Repository: SayedHawas/InventoryDEPI_Graduation_Project
Catalog: smERP.SharedKernel/Localizations/Resources/SharedResources.*.resx
Languages: ar

# AddedSuccess
source: AddedSuccessfull
ar: تمت الاضافة بنجاح

source: Bad Request
ar: طلب خاطئ

source: Change Pass Failed
ar: فشل في تغيير كلمة المرور

source: Created
ar: تم الانشاء

source: Deleted
ar: تم الحذف

# DeletedFailed
source: Delete Failed
ar: فشل في الحذف

# DeletedSuccess
source: Deleted Successfully
ar: تم الحذف بنجاح

# EmailExist
source: Email Already Exists
ar: البريد الإلكتروني موجود سابقا

source: Faild To Add
ar: فشل في الإضافة

# GetSuccess
source: Get Successfully
ar: تم استدعاء البيانات بنجاح

# DoesExist
source: {0} Already Exist
ar: {0} موجود بالفعل

# DoesNotExist
source: {0} Does Not Exist
ar: {0} غير موجود

source: Max Length is 150
ar: الحد الأقصى للطول هو 150

source: Max Length is 250
ar: الحد الأقصى للطول هو 250

source: NameAr Is Exist
ar: اسم بالعربي موجود

source: NameEn Is Exist
ar: اسم الانجليزي موجود

source: Not Data
ar: لا يوجد بيانات

# NotEmpty
source: Must Not Empty
ar: غير مسموح بترك الحقل فارغ

source: Not Found
ar: غير موجود

source: Password
ar: كلمة المرور

source: Password Not Correct
ar: كلمة المرور غير صحيحة

source: Password Not Equal Confirm Pass
ar: كلمة المرور غير مساوية للتاكيد

# Required
source: {0} Is Required
ar: {0} مطلوب

source: Success
ar: تم بنجاح

source: UnAuthorized
ar: غير مصرح

# UnprocessableEntity
source: There are Validation Errors Or Syntax Errors
ar: يوجد مشاكل في صيغة البيانات او نوعها عن المطلوب

source: Updated
ar: تحديث

# UpdatedSuccess
source: Updated Successfully
ar: تم التحديث بنجاح

source: Update Failed
ar: تحديث غير مكتمل

source: Username
ar: اسم المستخدم

source: Username Is Exist
ar: اسم المستخدم موجود

source: Company
ar: الشركة

source: Name
ar: أسم

source: Company Name
ar: اسم الشركة

# DatabaseError
source: Error while saving data
ar: خطأ في حفظ البيانات

# InternalServerError
source: Server Error
ar: خطأ من السيرفر

source: Category Name
ar: اسم الصنف

source: Brand Name
ar: اسم الماركة

source: Attribute Name
ar: اسم الصفة

source: Attribute Value
ar: قيمة الصفة

source: Product Name
ar: اسم المنتج

source: Model Number
ar: رقم الموديل

source: Parent Category
ar: الصنف الرئيسي

# NameAtleastOneLetter
source: {0} Must be Atleast One Letter
ar: {0} يجب علي الاقل ان يكون حرف واحد

# NameEn
source: English Name
ar: اسم انجليزي

# NameAr
source: Arabic Name
ar: اسم عربي

source: Category
ar: الصنف

# ParentCategoryMustHaveNoProduct
source: Parent Category Must Have No Products That Directly Falls Under It
ar: الصنف الرئيسي يجب الا يحتوي علي منتجات مباشرة

source: Brand
ar: الماركة

source: Attribute
ar: الصفة

# CategoryMustBeLeaf
source: Category Cannot Be a Parent To Another Category
ar: الصنف يجب الا يكون رئيسي لصنف اخر

source: Product
ar: المنتج

# ___ListMustContainAtleastOneItem
source: {0} Must Contain Atleast One Item
ar: {0} يجب ان تحتوي علي الاقل وحدة

source: Attribute List
ar: قائمة الصفات

# ___ListCannotContainDuplicates
source: {0} Cannot Contain Duplicates
ar: {0} لا يمكن ان تحتوي علي قيم متشابهة

# SomeItemsIn___ListAreNotCorrect
source: Some Items in {0} Are Not Correct
ar: بعض القيم في {0} غير صحيحة

# ___MustBeAPositiveNumber
source: {0} Must Be A Positive Number
ar: {0} يجب ان يكون رقم موجب

source: Selling Price
ar: سعر البيع

source: Buying Price
ar: سعر الشراء

# ProductInstanceDuplicate
source: There Is A Product With The Same Attributes
ar: هناك منتج بهذه الصفات بالفعل

source: Street
ar: الشارع

source: City
ar: المدينة

source: Country
ar: الدولة

source: State
ar: محافظة

source: Address
ar: العنوان

source: Supplier
ar: المورد

source: Price
ar: السعر

source: Payed Amount
ar: المبلغ المدفوع

source: Payment Method
ar: طريقة الدفع

source: Shelf Life
ar: عمر المنتج

source: Storage Location
ar: مكان تخزين

source: SerialNumber
ar: رقم التسلسلي

# EnteredExpirationDateCannotExceedProductShelfLife
source: Entered Expiration Date Cannot Exceed Product Default Shelf Life
ar: تاريخ الصلاحية المدخل لا يمكن ان يتعدي تاريخ الصلاحية الخاص بالمنتج

source: Branch
ar: الفرع

source: Expiration Date Must Be In The Future
ar: تاريخ انتهاء الصلاحية يجب ان يكون في المستقبل

source: Phone Number
ar: رقم الهاتف

# ___MustBeBetween_And_
source: {0} Must Be Between {1} And {2}
ar: {0} يجب ان يكون ما بين {1} و {2}

# PasswordOrEmailNotCorrect
source: Passsword Or/And Email Are Not Correct
ar: الايميل او كلمة السر غير صحيحة

source: Email
ar: الايميل

source: Role
ar: الوظيفة

source: Claim
ar: حق

source: User
ar: المستخدم

# ___FieldDoesNotMeetCriteria
source: {0} Does Not Meet Field Criteria
ar: {0} لا يطابق شروط الحقل

source: This Transaction Is Already Processed
ar: هذه العملية تمت معالجتها بالفعل

source: Payment Transaction
ar: عملية الدفع

# ThereSomeThingWrongWithImageProvided
source: There An Error With The Image Uploaded
ar: يوجد خطا بالصورة المرفوعة

source: Image
ar: صورة

# Invalid___
source: Invalid {0}
ar: {0} خاطئة

# FileSizeExceedsTheMaximumAllowedSizeOf___MB
source: File Size Exceeds The Maximum Allowed Size Of {0} MB
ar: حجم الملف يتعدي الحد المسموح به {0} ميجا بايت

# AccountDisabledContactAdmin
source: This account is disabled, contact admin
ar: هذا الحساب مغلق تواصل مع ادمن

source: Produc tInstance Must Have Atleast One Image
ar: المنتج يجب ان يحتوي علي صورة علي الاقل

source: File Was Not Deleted Please Try Again Later
ar: حذف الملف لم يتم برجاء المحاولة لاحقا

source: Please Try To Login Again
ar: يرجي محاولة تسجيل الدخول مرة اخري
